app/Http/Controllers/OrderController.php

    public function Access(Request $request)
    {
        //Busca os dados no banco de dados
        $orderQuery = DB::table('alt_orders')
        ->where('order_id', '=', $request->orderid)
        ->where('token', '=', $request->email)
        ->get();
---
select * from `alt_orders` where `order_id` = '1234' and `token` = 'test@test.com'