app/Http/Controllers/Dashboard/DashboardController.php

    public function index()
    {
        $orders_doing =
            DB::table('alt_orders')
            ->whereNull('approved_at')
            ->whereDate('expire_at', '>=', Carbon::now())
            ->OrderBy('id', 'desc')
            ->get();

        $orders_ready =
            DB::table('alt_orders')
            ->whereNotNull('approved_at')
            ->whereNull('ready_at')
            ->whereDate('expire_at', '>=', Carbon::now())
            ->OrderBy('id', 'desc')
            ->get();

        return
            view('dashboard.index')
            ->with([
                'title'        => 'Phoenix Dashboard',
                'order_doing'  => $orders_doing,
                'order_ready'  => $orders_ready,
                'orders_count' => DB::table('alt_orders')->count(),
                'cards_count'  => DB::table('alt_orders_data')->count(),
            ]);
---
select * from `alt_orders` where `approved_at` is null order by `id` desc
select * from `alt_orders` where `approved_at` is not null and `ready_at` is null order by `id` desc
select count(*) as aggregate from `alt_orders_data`
select count(*) as aggregate from `alt_orders`