app/Http/Controllers/Dashboard/NewOrderController.php

select * from `alt_cards` where `isBack` = 0 order by `id` desc
---
    public function cardFront()
    {
        $QueryCards = DB::table('alt_cards')
        ->where('isBack', 0)
        ->OrderBy('id', 'desc')
        ->get();

select * from `alt_cards` where `isBack` = 1 order by `id` desc
---
    public function cardBack($frontid)
    {
        $QueryCards = DB::table('alt_cards')
        ->where('isBack', 1)
        ->OrderBy('id', 'desc')
        ->get();